000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "HELLOWORLD".
000003 AUTHOR. KARUKAMI.
000004
000005 ENVIRONMENT DIVISION.
000006 
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009 01 WS-NAME PIC A(20).
000010
000011 PROCEDURE DIVISION.
000012       1000-START-PARA.
000013       DISPLAY "Enter your name : " WITH NO ADVANCING.
000014       ACCEPT WS-NAME.
000015       DISPLAY " Welcome " WS-NAME.
000016 STOP RUN.
